[
  {
    "id": 1,
    "title": "Article 1",
    "content": "1. Name and territory of the Union.—(1) India, that is Bharat,\nshall be a Union of States. 1\n[(2) The States and the territories thereof shall be as specified in\nthe First Schedule.]\n(3) The territory of India shall comprise—\n(a) the territories of the States; 2\n[(b) the Union territories specified in the First Schedule;\nand]\n(c) such other territories as may be acquired."
  },
  {
    "id": 2,
    "title": "Article 2",
    "content": "2. Admission or establishment of new States.—Parliament may\nby law admit into the Union, or establish, new States on such terms and\nconditions as it thinks fit.\n3\n[2A. [Sikkim to be associated with the Union.] —Omitted by the\nConstitution (Thirty-sixth Amendment) Act, 1975, s. 5 (w.e.f. 26-4-1975).]"
  },
  {
    "id": 3,
    "title": "Article 3",
    "content": "3. Formation of new States and alteration of areas,\nboundaries or names of existing States.—Parliament may by law—\n(a) form a new State by separation of territory from any\nState or by uniting two or more States or parts of States or by\nuniting any territory to a part of any State;\n(b) increase the area of any State;\n(c) diminish the area of any State;\n(d) alter the boundaries of any State;\n(e) alter the name of any State:  [Provided that no Bill for the purpose shall be introduced in\neither House of Parliament except on the recommendation of the\nPresident and unless, where the proposal contained in the Bill affects\nthe area, boundaries or name of any of the States12\n\n***, the Bill has\nbeen referred by the President to the Legislature of that State for\nexpressing its views thereon within such period as may be specified in\nthe reference or within such further period as the President may allow\nand the period so specified or allowed has expired.]\n3\n[Explanation I.—In this article, in clauses (a) to (e), “State”\nincludes a Union territory, but in the proviso, “State” does not include a\nUnion territory.\nExplanation II.—The power conferred on Parliament by\nclause (a) includes the power to form a new State or Union territory by\nuniting a part of any State or Union territory to any other State or\nUnion territory.]"
  },
  {
    "id": 4,
    "title": "Article 4",
    "content": "4. Laws made under articles 2 and 3 to provide for the\namendment of the First and the Fourth Schedules and\nsupplemental, incidental and consequential matters.—(1) Any law\nreferred to in article 2 or article 3 shall contain such provisions for the\namendment of the First Schedule and the Fourth Schedule as may be\nnecessary to give effect to the provisions of the law and may also\ncontain such supplemental, incidental and consequential provisions\n(including provisions as to representation in Parliament and in the\nLegislature or Legislatures of the State or States affected by such law)\nas Parliament may deem necessary.\n(2) No such law as aforesaid shall be deemed to be an\namendment of this Constitution for the purposes of article 368."
  },
  {
    "id": 5,
    "title": "Article 5",
    "content": "5. Citizenship at the commencement of the Constitution.—At the\ncommencement of this Constitution, every person who has his domicile in the\nterritory of India and—\n(a) who was born in the territory of India; or\n(b) either of whose parents was born in the territory of India; or\n(c) who has been ordinarily resident in the territory of India for\nnot less than five years immediately preceding such commencement,\nshall be a citizen of India."
  },
  {
    "id": 6,
    "title": "Article 6",
    "content": "6. Rights of citizenship of certain persons who have migrated to\nIndia from Pakistan.—Notwithstanding anything in article 5, a person who\nhas migrated to the territory of India from the territory now included in\nPakistan shall be deemed to be a citizen of India at the commencement of this\nConstitution if—\n(a) he or either of his parents or any of his grand-parents was born\nin India as defined in the Government of India Act, 1935 (as originally\nenacted); and\n(b)(i) in the case where such person has so migrated before the\nnineteenth day of July, 1948, he has been ordinarily resident in the\nterritory of India since the date of his migration, or\n(ii) in the case where such person has so migrated on or after the\nnineteenth day of July, 1948, he has been registered as a citizen of India\nby an officer appointed in that behalf by the Government of the\nDominion of India on an application made by him therefor to such\nofficer before the commencement of this Constitution in the form and\nmanner prescribed by that Government:\nProvided that no person shall be so registered unless he has been resident\nin the territory of India for at least six months immediately preceding the date\nof his application."
  },
  {
    "id": 7,
    "title": "Article 7",
    "content": "7. Rights of citizenship of certain migrants to Pakistan.—\nNotwithstanding anything in articles 5 and 6, a person who has after the first\nday of March, 1947, migrated from the territory of India to the territory now\nincluded in Pakistan shall not be deemed to be a citizen of India:Provided that nothing in this article shall apply to a person who, after\nhaving so migrated to the territory now included in Pakistan, has returned to the\nterritory of India under a permit for resettlement or permanent return issued by\nor under the authority of any law and every such person shall for the purposes\nof clause (b) of article 6 be deemed to have migrated to the territory of India\nafter the nineteenth day of July, 1948."
  },
  {
    "id": 8,
    "title": "Article 8",
    "content": "8. Rights of citizenship of certain persons of Indian origin residing\noutside India.—Notwithstanding anything in article 5, any person who or\neither of whose parents or any of whose grand-parents was born in India as\ndefined in the Government of India Act, 1935 (as originally enacted), and who\nis ordinarily residing in any country outside India as so defined shall be deemed\nto be a citizen of India if he has been registered as a citizen of India by the\ndiplomatic or consular representative of India in the country where he is for the\ntime being residing on an application made by him therefor to such diplomatic\nor consular representative, whether before or after the commencement of this\nConstitution, in the form and manner prescribed by the Government of the\nDominion of India or the Government of India."
  },
  {
    "id": 9,
    "title": "Article 9",
    "content": "9. Persons voluntarily acquiring citizenship of a foreign State not to\nbe citizens.—No person shall be a citizen of India by virtue of article 5, or be\ndeemed to be a citizen of India by virtue of article 6 or article 8, if he has\nvoluntarily acquired the citizenship of any foreign State."
  },
  {
    "id": 10,
    "title": "Article 10",
    "content": "10. Continuance of the rights of citizenship.—Every person who is or\nis deemed to be a citizen of India under any of the foregoing provisions of this\nPart shall, subject to the provisions of any law that may be made by Parliament,\ncontinue to be such citizen."
  },
  {
    "id": 11,
    "title": "Article 11",
    "content": "11. Parliament to regulate the right of citizenship by law.—Nothing\nin the foregoing provisions of this Part shall derogate from the power of\nParliament to make any provision with respect to the acquisition and\ntermination of citizenship and all other matters relating to citizenship."
  },
  {
    "id": 12,
    "title": "Article 12",
    "content": "12. Definition.—In this Part, unless the context otherwise requires, “the\nState” includes the Government and Parliament of India and the Government\nand the Legislature of each of the States and all local or other authorities within\nthe territory of India or under the control of the Government of India."
  },
  {
    "id": 13,
    "title": "Article 13",
    "content": "13. Laws inconsistent with or in derogation of the fundamental\nrights.—(1) All laws in force in the territory of India immediately before the\ncommencement of this Constitution, in so far as they are inconsistent with the\nprovisions of this Part, shall, to the extent of such inconsistency, be void.\n(2) The State shall not make any law which takes away or abridges the\nrights conferred by this Part and any law made in contravention of this clause\nshall, to the extent of the contravention, be void.\n(3) In this article, unless the context otherwise requires,—\n(a) “law” includes any Ordinance, order, bye-law, rule, regulation,\nnotification, custom or usage having in the territory of India the force of\nlaw;\n(b) “laws in force” includes laws passed or made by a Legislature\nor other competent authority in the territory of India before the\ncommencement of this Constitution and not previously repealed,\nnotwithstanding that any such law or any part thereof may not be then in\noperation either at all or in particular areas. 1\n[(4) Nothing in this article shall apply to any amendment of this\nConstitution made under article 368.]"
  },
  {
    "id": 14,
    "title": "Article 14",
    "content": "14. Equality before law.—The State shall not deny to any person\nequality before the law or the equal protection of the laws within the territory of\nIndia."
  },
  {
    "id": 15,
    "title": "Article 15",
    "content": "15. Prohibition of discrimination on grounds of religion, race, caste,\nsex or place of birth.—(1) The State shall not discriminate against any citizen\non grounds only of religion, race, caste, sex, place of birth or any of them.\n(2) No citizen shall, on grounds only of religion, race, caste, sex, place of\nbirth or any of them, be subject to any disability, liability, restriction or\ncondition with regard to—(a) access to shops, public restaurants, hotels and places of public\nentertainment; or\n(b) the use of wells, tanks, bathing ghats, roads and places of\npublic resort maintained wholly or partly out of State funds or dedicated\nto the use of the general public.\n(3) Nothing in this article shall prevent the State from making any\nspecial provision for women and children. 1\n[(4) Nothing in this article or in clause (2) of article 29 shall prevent the\nState from making any special provision for the advancement of any socially\nand educationally backward classes of citizens or for the Scheduled Castes and\nthe Scheduled Tribes.] 2\n[(5) Nothing in this article or in sub-clause (g) of clause (1) of article 19\nshall prevent the State from making any special provision, by law, for the\nadvancement of any socially and educationally backward classes of citizens or\nfor the Scheduled Castes or the Scheduled Tribes in so far as such special\nprovisions relate to their admission to educational institutions including private\neducational institutions, whether aided or unaided by the State, other than the\nminority educational institutions referred to in clause (1) of article 30.] 3\n[(6) Nothing in this article or sub-clause (g) of clause (1) of article 19 or\nclause (2) of article 29 shall prevent the State from making,—\n(a) any special provision for the advancement of any\neconomically weaker sections of citizens other than the classes\nmentioned in clauses (4) and (5); and\n(b) any special provision for the advancement of any\neconomically weaker sections of citizens other than the classes\nmentioned in clauses (4) and (5) in so far as such special provisions\nrelate to their admission to educational institutions including private\neducational institutions, whether aided or unaided by the State, other\nthan the minority educational institutions referred to in clause (1) of\narticle 30, which in the case of reservation would be in addition to the\nexisting reservations and subject to a maximum of ten per cent. of the\ntotal seats in each category.Explanation.—For the purposes of this article and article 16,\n\"economically weaker sections\" shall be such as may be notified by the State\nfrom time to time on the basis of family income and other indicators of\neconomic disadvantage.] "
  },
  {
    "id": 16,
    "title": "Article 16",
    "content": "16. Equality of opportunity in matters of public employment.—(1)\nThere shall be equality of opportunity for all citizens in matters relating to\nemployment or appointment to any office under the State.\n(2) No citizen shall, on grounds only of religion, race, caste, sex, descent,\nplace of birth, residence or any of them, be ineligible for, or discriminated against\nin respect of, any employment or office under the State.\n(3) Nothing in this article shall prevent Parliament from making any law\nprescribing, in regard to a class or classes of employment or appointment to an\noffice 1\n[under the Government of, or any local or other authority within, a State\nor Union territory, any requirement as to residence within that State or Union\nterritory] prior to such employment or appointment.\n(4) Nothing in this article shall prevent the State from making any\nprovision for the reservation of appointments or posts in favour of any\nbackward class of citizens which, in the opinion of the State, is not adequately\nrepresented in the services under the State. 2\n[(4A) Nothing in this article shall prevent the State from making any\nprovision for reservation 3\n\n[in matters of promotion, with consequential\nseniority, to any class] or classes of posts in the services under the State in\nfavour of the Scheduled Castes and the Scheduled Tribes which, in the opinion\nof the State, are not adequately represented in the services under the State.] 4\n[(4B) Nothing in this article shall prevent the State from considering\nany unfilled vacancies of a year which are reserved for being filled up in that\nyear in accordance with any provision for reservation made under clause (4) or\nclause (4A) as a separate class of vacancies to be filled up in any succeeding\nyear or years and such class of vacancies shall not be considered together with\nthe vacancies of the year in which they are being filled up for determining the\nceiling of fifty per cent. reservation on total number of vacancies of that year.](5) Nothing in this article shall affect the operation of any law which\nprovides that the incumbent of an office in connection with the affairs of any\nreligious or denominational institution or any member of the governing body\nthereof shall be a person professing a particular religion or belonging to a\nparticular denomination. 1\n[(6) Nothing in this article shall prevent the State from making any\nprovision for the reservation of appointments or posts in favour of any\neconomically weaker sections of citizens other than the classes mentioned in\nclause (4), in addition to the existing reservation and subject to a maximum of\nten per cent. of the posts in each category.]"
  },
  {
    "id": 17,
    "title": "Article 17",
    "content": "17. Abolition of Untouchability.—“Untouchability” is abolished and its\npractice in any form is forbidden. The enforcement of any disability arising out\nof “Untouchability” shall be an offence punishable in accordance with law."
  },
  {
    "id": 18,
    "title": "Article 18",
    "content": "18. Abolition of titles.—(1) No title, not being a military or academic\ndistinction, shall be conferred by the State.\n(2) No citizen of India shall accept any title from any foreign State.\n(3) No person who is not a citizen of India shall, while he holds any\noffice of profit or trust under the State, accept without the consent of the\nPresident any title from any foreign State.\n(4) No person holding any office of profit or trust under the State shall,\nwithout the consent of the President, accept any present, emolument, or office\nof any kind from or under any foreign State."
  },
  {
    "id": 19,
    "title": "Article 19",
    "content": "19. Protection of certain rights regarding freedom of speech, etc.—\n(1) All citizens shall have the right—\n(a) to freedom of speech and expression;\n(b) to assemble peaceably and without arms;\n(c) to form associations or unions 2\n[or co-operative societies];\n\n(d) to move freely throughout the territory of India; (e) to reside and settle in any part of the territory of India; 1\n[and] 2\n[(f)* * * * *]\n(g) to practise any profession, or to carry on any occupation, trade or\nbusiness. 3\n[(2) Nothing in sub-clause (a) of clause (1) shall affect the operation of\nany existing law, or prevent the State from making any law, in so far as such\nlaw imposes reasonable restrictions on the exercise of the right conferred by the\nsaid sub-clause in the interests of 4\n\n[the sovereignty and integrity of India], the\nsecurity of the State, friendly relations with foreign States, public order,\ndecency or morality, or in relation to contempt of court, defamation or\nincitement to an offence.]\n(3) Nothing in sub-clause (b) of the said clause shall affect the operation\nof any existing law in so far as it imposes, or prevent the State from making\nany law imposing, in the interests of 4\n\n[the sovereignty and integrity of India or]\npublic order, reasonable restrictions on the exercise of the right conferred by\nthe said sub-clause.\n(4) Nothing in sub-clause (c) of the said clause shall affect the operation\nof any existing law in so far as it imposes, or prevent the State from making\nany law imposing, in the interests of 4\n\n[the sovereignty and integrity of India or]\npublic order or morality, reasonable restrictions on the exercise of the right\nconferred by the said sub-clause.\n(5) Nothing in 5\n\n[sub-clauses (d) and (e)] of the said clause shall affect\nthe operation of any existing law in so far as it imposes, or prevent the State\nfrom making any law imposing, reasonable restrictions on the exercise of any\nof the rights conferred by the said sub-clauses either in the interests of the\ngeneral public or for the protection of the interests of any Scheduled Tribe. (6) Nothing in sub-clause (g) of the said clause shall affect the operation\nof any existing law in so far as it imposes, or prevent the State from making\nany law imposing, in the interests of the general public, reasonable restrictions\non the exercise of the right conferred by the said sub-clause, and, in particular, 1\n[nothing in the said sub-clause shall affect the operation of any existing law in\nso far as it relates to, or prevent the State from making any law relating to,—\n(i) the professional or technical qualifications necessary for practising\nany profession or carrying on any occupation, trade or business; or\n(ii) the carrying on by the State, or by a corporation owned or\ncontrolled by the State, of any trade, business, industry or service,\nwhether to the exclusion, complete or partial, of citizens or otherwise.]"
  },
  {
    "id": 20,
    "title": "Article 20",
    "content": "20. Protection in respect of conviction for offences.—(1) No person\nshall be convicted of any offence except for violation of a law in force at the\ntime of the commission of the Act charged as an offence, nor be subjected to a\npenalty greater than that which might have been inflicted under the law in force\nat the time of the commission of the offence.\n(2) No person shall be prosecuted and punished for the same offence\nmore than once.\n(3) No person accused of any offence shall be compelled to be a witness\nagainst himself."
  }
]
