[
  {
    "id": 1,
    "title": "Article 1",
    "content": "1. Name and territory of the Union.—(1) India, that is Bharat,\nshall be a Union of States. 1\n[(2) The States and the territories thereof shall be as specified in\nthe First Schedule.]\n(3) The territory of India shall comprise—\n(a) the territories of the States; 2\n[(b) the Union territories specified in the First Schedule;\nand]\n(c) such other territories as may be acquired."
  },
  {
    "id": 2,
    "title": "Article 2",
    "content": "2. Admission or establishment of new States.—Parliament may\nby law admit into the Union, or establish, new States on such terms and\nconditions as it thinks fit.\n3\n[2A. [Sikkim to be associated with the Union.] —Omitted by the\nConstitution (Thirty-sixth Amendment) Act, 1975, s. 5 (w.e.f. 26-4-1975).]"
  },
  {
    "id": 3,
    "title": "Article 3",
    "content": "3. Formation of new States and alteration of areas,\nboundaries or names of existing States.—Parliament may by law—\n(a) form a new State by separation of territory from any\nState or by uniting two or more States or parts of States or by\nuniting any territory to a part of any State;\n(b) increase the area of any State;\n(c) diminish the area of any State;\n(d) alter the boundaries of any State;\n(e) alter the name of any State:  [Provided that no Bill for the purpose shall be introduced in\neither House of Parliament except on the recommendation of the\nPresident and unless, where the proposal contained in the Bill affects\nthe area, boundaries or name of any of the States12\n\n***, the Bill has\nbeen referred by the President to the Legislature of that State for\nexpressing its views thereon within such period as may be specified in\nthe reference or within such further period as the President may allow\nand the period so specified or allowed has expired.]\n3\n[Explanation I.—In this article, in clauses (a) to (e), “State”\nincludes a Union territory, but in the proviso, “State” does not include a\nUnion territory.\nExplanation II.—The power conferred on Parliament by\nclause (a) includes the power to form a new State or Union territory by\nuniting a part of any State or Union territory to any other State or\nUnion territory.]"
  },
  {
    "id": 4,
    "title": "Article 4",
    "content": "4. Laws made under articles 2 and 3 to provide for the\namendment of the First and the Fourth Schedules and\nsupplemental, incidental and consequential matters.—(1) Any law\nreferred to in article 2 or article 3 shall contain such provisions for the\namendment of the First Schedule and the Fourth Schedule as may be\nnecessary to give effect to the provisions of the law and may also\ncontain such supplemental, incidental and consequential provisions\n(including provisions as to representation in Parliament and in the\nLegislature or Legislatures of the State or States affected by such law)\nas Parliament may deem necessary.\n(2) No such law as aforesaid shall be deemed to be an\namendment of this Constitution for the purposes of article 368."
  },
  {
    "id": 5,
    "title": "Article 5",
    "content": "5. Citizenship at the commencement of the Constitution.—At the\ncommencement of this Constitution, every person who has his domicile in the\nterritory of India and—\n(a) who was born in the territory of India; or\n(b) either of whose parents was born in the territory of India; or\n(c) who has been ordinarily resident in the territory of India for\nnot less than five years immediately preceding such commencement,\nshall be a citizen of India."
  },
  {
    "id": 6,
    "title": "Article 6",
    "content": "6. Rights of citizenship of certain persons who have migrated to\nIndia from Pakistan.—Notwithstanding anything in article 5, a person who\nhas migrated to the territory of India from the territory now included in\nPakistan shall be deemed to be a citizen of India at the commencement of this\nConstitution if—\n(a) he or either of his parents or any of his grand-parents was born\nin India as defined in the Government of India Act, 1935 (as originally\nenacted); and\n(b)(i) in the case where such person has so migrated before the\nnineteenth day of July, 1948, he has been ordinarily resident in the\nterritory of India since the date of his migration, or\n(ii) in the case where such person has so migrated on or after the\nnineteenth day of July, 1948, he has been registered as a citizen of India\nby an officer appointed in that behalf by the Government of the\nDominion of India on an application made by him therefor to such\nofficer before the commencement of this Constitution in the form and\nmanner prescribed by that Government:\nProvided that no person shall be so registered unless he has been resident\nin the territory of India for at least six months immediately preceding the date\nof his application."
  },
  {
    "id": 7,
    "title": "Article 7",
    "content": "7. Rights of citizenship of certain migrants to Pakistan.—\nNotwithstanding anything in articles 5 and 6, a person who has after the first\nday of March, 1947, migrated from the territory of India to the territory now\nincluded in Pakistan shall not be deemed to be a citizen of India:Provided that nothing in this article shall apply to a person who, after\nhaving so migrated to the territory now included in Pakistan, has returned to the\nterritory of India under a permit for resettlement or permanent return issued by\nor under the authority of any law and every such person shall for the purposes\nof clause (b) of article 6 be deemed to have migrated to the territory of India\nafter the nineteenth day of July, 1948."
  },
  {
    "id": 8,
    "title": "Article 8",
    "content": "8. Rights of citizenship of certain persons of Indian origin residing\noutside India.—Notwithstanding anything in article 5, any person who or\neither of whose parents or any of whose grand-parents was born in India as\ndefined in the Government of India Act, 1935 (as originally enacted), and who\nis ordinarily residing in any country outside India as so defined shall be deemed\nto be a citizen of India if he has been registered as a citizen of India by the\ndiplomatic or consular representative of India in the country where he is for the\ntime being residing on an application made by him therefor to such diplomatic\nor consular representative, whether before or after the commencement of this\nConstitution, in the form and manner prescribed by the Government of the\nDominion of India or the Government of India."
  },
  {
    "id": 9,
    "title": "Article 9",
    "content": ""
  },
  {
    "id": 10,
    "title": "Article 10",
    "content": ""
  },
  {
    "id": 11,
    "title": "Article 11",
    "content": ""
  },
  {
    "id": 12,
    "title": "Article 12",
    "content": ""
  },
  {
    "id": 13,
    "title": "Article 13",
    "content": ""
  },
  {
    "id": 14,
    "title": "Article 14",
    "content": ""
  },
  {
    "id": 15,
    "title": "Article 15",
    "content": ""
  },
  {
    "id": 16,
    "title": "Article 16",
    "content": ""
  },
  {
    "id": 17,
    "title": "Article 17",
    "content": ""
  },
  {
    "id": 18,
    "title": "Article 18",
    "content": ""
  },
  {
    "id": 19,
    "title": "Article 19",
    "content": ""
  },
  {
    "id": 20,
    "title": "Article 20",
    "content": ""
  }
]
